In [3]:
import pandas as pd
import numpy as np

In [7]:
data = pd.read_csv("water_dataX.csv")

In [8]:
data.head()

,STATION CODE,LOCATIONS,STATE,Temp,D.O. (mg/l),PH,CONDUCTIVITY (mhos/cm),B.O.D. (mg/l),NITRATENAN N+ NITRITENANN (mg/l),FECAL COLIFORM (MPN/100ml),TOTAL COLIFORM (MPN/100ml)Mean,year
0,1393,"DAMANGANGA AT D/S OF MADHUBAN, DAMAN",DAMAN & DIU,30.6,6.7,7.5,203,NAN,0.1,11,27,2014
1,1399,ZUARI AT D/S OF PT. WHERE KUMBARJRIA CANAL JOI...,GOA,29.8,5.7,7.2,189,2,0.2,4953,8391,2014
2,1475,ZUARI AT PANCHAWADI,GOA,29.5,6.3,6.9,179,1.7,0.1,3243,5330,2014
3,3181,RIVER ZUARI AT BORIM BRIDGE,GOA,29.7,5.8,6.9,64,3.8,0.5,5382,8443,2014
4,3182,RIVER ZUARI AT MARCAIM JETTY,GOA,29.5,5.8,7.3,83,1.9,0.4,3428,5500,2014

In [9]:
data.describe()

              year
count  1991.000000
mean   2010.038172
std       3.057333
min    2003.000000
25%    2008.000000
50%    2011.000000
75%    2013.000000
max    2014.000000

In [12]:
data.columns

Index(['STATION CODE', 'LOCATIONS', 'STATE', 'Temp', 'D.O. (mg/l)', 'PH',
       'CONDUCTIVITY (mhos/cm)', 'B.O.D. (mg/l)',
       'NITRATENAN N+ NITRITENANN (mg/l)', 'FECAL COLIFORM (MPN/100ml)',
       'TOTAL COLIFORM (MPN/100ml)Mean', 'year'],
      dtype='object')

In [13]:
temp_data = data[['Temp', 'D.O. (mg/l)', 'PH',
       'CONDUCTIVITY (mhos/cm)', 'B.O.D. (mg/l)',
       'NITRATENAN N+ NITRITENANN (mg/l)', 'FECAL COLIFORM (MPN/100ml)',
       'TOTAL COLIFORM (MPN/100ml)Mean', 'year']]

In [14]:
temp_data.head()

,Temp,D.O. (mg/l),PH,CONDUCTIVITY (mhos/cm),B.O.D. (mg/l),NITRATENAN N+ NITRITENANN (mg/l),FECAL COLIFORM (MPN/100ml),TOTAL COLIFORM (MPN/100ml)Mean,year
0,30.6,6.7,7.5,203,NAN,0.1,11,27,2014
1,29.8,5.7,7.2,189,2,0.2,4953,8391,2014
2,29.5,6.3,6.9,179,1.7,0.1,3243,5330,2014
3,29.7,5.8,6.9,64,3.8,0.5,5382,8443,2014
4,29.5,5.8,7.3,83,1.9,0.4,3428,5500,2014

In [16]:
temp_data

,Temp,D.O. (mg/l),PH,CONDUCTIVITY (mhos/cm),B.O.D. (mg/l),NITRATENAN N+ NITRITENANN (mg/l),FECAL COLIFORM (MPN/100ml),TOTAL COLIFORM (MPN/100ml)Mean,year
0,30.6,6.7,7.5,203,NAN,0.1,11,27,2014
1,29.8,5.7,7.2,189,2,0.2,4953,8391,2014
2,29.5,6.3,6.9,179,1.7,0.1,3243,5330,2014
3,29.7,5.8,6.9,64,3.8,0.5,5382,8443,2014
4,29.5,5.8,7.3,83,1.9,0.4,3428,5500,2014
...,...,...,...,...,...,...,...,...,...
1986,NAN,7.9,738,7.2,2.7,0.518,0.518,202,2003
1987,29,7.5,585,6.3,2.6,0.155,0.155,315,2003
1988,28,7.6,98,6.2,1.2,NAN,NAN,570,2003
1989,28,7.7,91,6.5,1.3,NAN,NAN,562,2003
1990,29,7.6,110,5.7,1.1,NAN,NAN,546,2003